---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures
source: html/3cc426b3-e4e1-dbe8-1130-9a79c9541bfa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures

Failures related to alignment elements and annotations.

## Syntax (C#)
```csharp
public static class AlignmentFailures
```